## Intermediate SQL

In [2]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    for row in cursor:
        display(row)
df = print_all()
display(df.head())

,0,1,2,3,4,5,6,7,8
0,389,Sheena,1984.0,UK,117.0,English,PG,NaN,25000000.0
1,390,Splash,1984.0,USA,111.0,English,PG,69800000.0,8000000.0
2,391,Star Trek III: The Search for Spock,1984.0,USA,105.0,English,PG,76400000.0,17000000.0
3,392,The Bounty,1984.0,UK,132.0,English,PG,8600000.0,25000000.0
4,393,The Cotton Club,1984.0,USA,123.0,English,R,25900000.0,58000000.0

### Selecting Data

#### Query execution

#### Order of execution
* SQL is not processed in its written order

In [9]:
# Order of execution
sql = """SELECT name FROM people LIMIT 10"""
run_statement(sql)

DatabaseError: ORA-00933: SQL command not properly ended

* `LIMIT` limits how many results we return
* Good to know processing order for debugging and aliasing
* Aliases are declared in the SELECT statement

#### Debugging SQL

In [3]:
sql= """SELECT nme FROM people"""
run_statement(sql)

DatabaseError: ORA-00904: "NME": invalid identifier

field "nme" does not exist
LINE 1: SELECT nme

HINT: Perhaps you meant to reference the field "people.name".

* Misspelling
* Incorrect capitalization
* Incorrect or missing punctuation

#### Comma errors
* Look out for comma errors!

In [10]:
# SELECT title, country duration
# FROM films;

#### Keyword errors

In [13]:
# SELCT title, country, duration
# FROM films;

(8397, 6152)

syntax error at or near "SELCT"
LINE 1: SELCT title, country, duration

#### Final note on errors
Most common errorrs:
* Misspelling
* Incorrect capitalization
* Incorrect or missing punctuation, especially commas


Learn from making mistakes